<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"7168b74fd387244d571dc0c4d019d1921e5a021ff09e6b43228e8f3b53b644db","plan_job_ref":"Job .github/workflows/_test-tf.yaml #236 at https://github.com/tx-pts-dai/github-workflows/actions/runs/12766876647","plan_out_hash":"ae170e22808f3dd4b4181058902ff7073fa9cc2811f5befb39c2459e181e7928","plan_hash":"fe9c7be7d12e466283f9689492fcb0e5826f154cfa28e01b25fb8da5e995dec9","plan_text_format":"diff","version":"1.46.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #236](https://github.com/tx-pts-dai/github-workflows/actions/runs/12766876647)